tutorials/fluid/squareBendLiq/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "p.*"
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-7;
        relTol          0;
    }

    "(U|e|k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-7;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;

    transonic       no;
    consistent      no;
}

relaxationFactors
{
    equations
    {
        ".*"            1;
    }
}

// ************************************************************************* //
